Tekla.Structures.Drawing.ContainerElement
The ContainerElement class defines container elements. A container element
is a mark element that has a frame and contains other mark elements.
A container element may also contain container elements to achieve nested frames.

Tekla.Structures.Drawing.ContainerElement.Frame
The frame of the container element.

Tekla.Structures.Drawing.ContainerElement.Count
Gets the number of elements contained in the .

Tekla.Structures.Drawing.ContainerElement.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An  object that can be used to iterate through the collection.

Tekla.Structures.Drawing.ContainerElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.ContainerElement.CopyTo(System.Array,System.Int32)
Copies the elements of the  to
an , starting at a particular  index.
array:
The one-dimensional  that is the destination of the elements copied from
the . The  must have zero-based indexing.
index: The zero-based index in the array at which copying begins.
Throws System.ArgumentNullException: The array is null.
Throws System.ArgumentOutOfRangeException: The index is less than zero.
Throws System.ArgumentException:
The array is multidimensional, or the index is equal to or greater than the length of the array, or the number of elements
in the source  is greater than the available space from the index to
the end of the destination array.
Throws System.InvalidCastException:
The type of the source  cannot be cast automatically to the type of
the destination array.
2

Tekla.Structures.Drawing.ContainerElement.IsSynchronized
Gets a value indicating whether access to the  is synchronized (thread safe).
2

Tekla.Structures.Drawing.ContainerElement.SyncRoot
Gets an object that can be used to synchronize access to the .
2

Tekla.Structures.Drawing.ContainerElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ContainerElement.Add(Tekla.Structures.Drawing.ElementBase)
Adds a new element base to the end of the list.
value: The element base to be added to the list.

Tekla.Structures.Drawing.ContainerElement.Clear
Removes all elements from the container instance.

Tekla.Structures.Drawing.ContainerElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.

Tekla.Structures.Drawing.ContainerElement.op_Implicit(System.String)~Tekla.Structures.Drawing.ContainerElement
Implicit operator to convert a string to a container element.
value: String value